<?php
    // масив з маршрутами, title сторінок, назва файлу
    $routes = [
        "/" => [
            "title" => "ГОЛОВНА",
             "file" => "home.php"
            ],
        "/page1" => [
            "title" => "СТОРІНКА 1",
             "file" => "page1.php"
            ],
        "/page2" => [
            "title" => "СТОРІНКА 2",
             "file" => "page2.php"
            ],
        "/page3" => [
            "title" => "СТОРІНКА 3",
            "file" => "page3.php"
        ],
    ];

    // Отримуємо URL, введений в строку в браузері, наприклад http://localhost:8080/page1
    $url = $_SERVER["REQUEST_URI"]; // в цю змінну запишеться "/page1" в даному випадку

    // Перевіряємо, чи існує у масиві $routes ключ, який співпадає з поточним URL ($url)
    if (isset($routes[$url])) {
        // Якщо такий ключ є, значить ми знаємо цю сторінку
        
        // Встановлюємо змінну $title заголовком сторінки, який зберігається у масиві $routes для цього URL
        $title = $routes[$url]["title"];
        
        // Підключаємо відповідний файл сторінки.
        // Шляхи файлів зберігаються у $routes[$url]["file"], а всі файли лежать у папці "pages"
        include "pages/" . $routes[$url]["file"];
    } else {
        // Якщо ключа в масиві $routes для поточного URL нема,
        // це означає, що сторінка не знайдена
        
        // Встановлюємо заголовок сторінки помилки 404
        $title = "Сторінка не знайдена";
        
        // Підключаємо файл зі сторінкою помилки 404, який лежить у папці "pages"
        include "pages/404.php";
    }
